{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Hi", "Hello", "Hey", "Salut", "Bonjour", "Coucou", "Yo", "Hey there", "Good morning", "Bonsoir","cc","salam"],
      "responses": [
        "Hello! I'm Michael, Islam Merzouk's personal assistant. How can I assist you today?",
        "Bonjour! Je suis Michael, l'assistant personnel d'Islam Merzouk. Que puis-je faire pour vous?",
        "Hey there! Michael here. How may I help regarding Islam Merzouk?"
      ]
    },
    {
      "tag": "about_islam",
      "patterns": [
        "Who is Islam Merzouk?", "Tell me about Islam Merzouk", "Parle-moi d'Islam Merzouk", "C'est qui Islam Merzouk?", "Can you describe Islam Merzouk?"
       ],
      "responses": [
        "Islam Merzouk is a passionate computer science engineering student from Algeria, currently studying at the University of Mons in Belgium. He specializes in artificial intelligence and innovative technology solutions.",
        "Islam Merzouk est un étudiant algérien en ingénierie informatique à l'Université de Mons en Belgique. Il est passionné par l'intelligence artificielle et les innovations technologiques."
      ]
    },
    {
      "tag": "education",
      "patterns": [
        "What did he study?", "Parle de ses études", "What is his educational background?", "Quels diplômes a-t-il?", "Where did he study?"
      ],
      "responses": [
        "Islam holds a Bachelor's degree in Computer Science from Algeria and completed a Master 1 in Artificial Intelligence at the University of Mons in Belgium.",
        "Il a obtenu une licence en informatique en Algérie, et a poursuivi un Master 1 en Intelligence Artificielle à l’Université de Mons en Belgique."
      ]
    },
    {
      "tag": "skills",
      "patterns": [
        "What are his skills?", "Quelles sont ses compétences?", "What does he know?", "What can he do?", "Parle de ses connaissances techniques"
      ],
      "responses": [
        "Islam is skilled in Python, JavaScript, Odoo framework, and machine learning. He also has experience with web development (HTML, CSS, Flask) and database management.",
        "Il maîtrise Python, JavaScript, le framework Odoo, ainsi que le machine learning. Il a aussi de l’expérience en développement web et en gestion de bases de données."
      ]
    },
    {
      "tag": "ai_projects",
      "patterns": [
        "What AI projects has he done?", "Quels projets IA a-t-il réalisés?", "Give examples of his projects", "Parle de ses projets en intelligence artificielle"
      ],
      "responses": [
        "Islam has developed several AI-based projects, such as an image recognition model, a recommendation system, and intelligent chatbots for business automation.",
        "Il a développé plusieurs projets basés sur l’IA, tels qu’un modèle de reconnaissance d’images, un système de recommandation et des chatbots intelligents."
      ]
    },
    {
      "tag": "experience",
      "patterns": [
        "What professional experience does he have?", "A-t-il fait des stages?", "What has he done professionally?", "Parle de son expérience professionnelle"
      ],
      "responses": [
        "He completed an internship developing a website for a dental clinic, where he gained solid web development experience and client communication skills.",
        "Il a effectué un stage où il a développé un site web pour une clinique dentaire, acquérant une expérience précieuse en développement et communication client."
      ]
    },
    {
      "tag": "languages",
      "patterns": [
        "What languages does he speak?", "Quelles langues parle-t-il?", "Does he speak English?", "Est-ce qu'il parle français?"
      ],
      "responses": [
        "Islam speaks Arabic, French, and English fluently, which allows him to communicate easily in international environments.",
        "Il parle couramment l’arabe, le français et l’anglais, ce qui lui permet de travailler dans un contexte international."
      ]
    },
    {
      "tag": "personality",
      "patterns": [
        "How would you describe his personality?", "Comment est-il?", "Quel est son caractère?", "Is he social?", "Décris sa personnalité"
      ],
      "responses": [
        "Islam is calm, disciplined, and curious. He’s very sociable and enjoys teamwork as much as independent learning.",
        "Islam est calme, discipliné et curieux. Il aime travailler en équipe mais sait aussi être autonome et concentré."
      ]
    },
    {
      "tag": "goals",
      "patterns": [
        "What are his goals?", "Quels sont ses objectifs?", "What does he want to achieve?", "Quels sont ses rêves?"
      ],
      "responses": [
        "Islam aims to become an AI expert and contribute to developing intelligent, ethical technologies that make people's lives easier.",
        "Il souhaite devenir un expert en intelligence artificielle et participer au développement de technologies intelligentes et éthiques."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How can I contact him?", "Comment le contacter?", "What is his email?", "Peux-tu me donner ses coordonnées?"
      ],
      "responses": [
        "You can reach Islam Merzouk by email at islam.merzouk@example.com or via LinkedIn: linkedin.com/in/islam-merzouk.",
        "Vous pouvez contacter Islam Merzouk par e-mail à islam.merzouk@example.com ou sur LinkedIn : linkedin.com/in/islam-merzouk."
      ]
    },
    {
      "tag": "portfolio",
      "patterns": [
        "Where can I see his portfolio?", "Montre-moi son portfolio", "A-t-il un site web?", "Can I see his work online?"
      ],
      "responses": [
        "You can visit his portfolio here: https://islammerzouk.com — it showcases his projects, experiences, and AI experiments.",
        "Son portfolio est disponible ici : https://islammerzouk.com — vous y trouverez ses projets, expériences et travaux en IA."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "Merci", "C’est gentil", "Thanks a lot"],
      "responses": ["You're very welcome!", "De rien, avec plaisir!", "Happy to help!"]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "Goodbye", "See you", "Au revoir", "À bientôt"],
      "responses": ["Goodbye! Have a great day!", "Au revoir! Passez une excellente journée!", "À bientôt!"]
    }
  ]
}
